# Задаеп массив значений х
x = [1.340, 1.345, 1.350, 1.355, 1.360, 1.365, 1.37, 1.375, 1.380, 1.385, 1.390, 1.395, 1.400]
# Задаеп массив значений y
y = [4.25562, 4.35325, 4.45522,4.56184,4.67344,4.79038,4.91306,5.04192,5.17744,5.32016, 5.47069, 5.62968, 5.76999]
# Задаеп массив значений аргумента 
value = [1.32, 1.345, 1.353, 1.388, 1.41]
print("Интерполяция многочленом Лагранжа (равноотстоящие узлы):")
for g in value: # Подставляем значения аргумента 
    sum = 0
    for j in range(len(x)):
        proiz = 1
        for i in range(len(x)):  
            if i != j:
                proiz *= (g - x[0] - i * (x[1] - x[0])) / ((x[1] - x[0]) * (j - i)) # Считаем (Х - Х0 - i * h) / (h * (j - i))
        sum += proiz * y[j]
    print("Значение в узле", g, "равно", round(sum, 5))


# Задаеп массив значений х
x = [0.11, 0.15, 0.21, 0.60, 0.29, 0.35]
# Задаеп массив значений y
y = [9.05421, 6.61659, 4.6917, 1.86208, 3.35106, 2.73951]
# Задаеп массив значений аргумента 
value = [0.332, 0.123] 
print("Интерполяция многочленом Лагранж (неравноотстоящие узлы):")
for g in value: # Подставляем значения аргумента 
    sum = 0
    for i in range(len(x)):
        proiz = 1 
        for j in range(len(x)):
            if i != j:
                proiz *= (g - x[j]) / (x[i] - x[j]) # Считаем (X - Xj) / (Xi - Xj)  
        sum += proiz * y[i]
    print("Значение в узле", g, "равно", round(sum, 5))
